app/Controllers/Admin.php

    public function index()
    {

        $currentMonth = $this->request->getPost('month') ?? date('m');
        $currentYear = $this->request->getPost('year') ?? date('Y');

        $data = [
            'title' => 'Dashboard Admin | SiUMKM',
            'navtitle' => 'Dashboard',
            'pendapatan' => $this->pendapatanModel->getPendapatanByMonthYear($currentMonth, $currentYear),
            'total_produk' => $this->produkModel->countAll(),
            'kategori' => $this->kategoriModel->getKategoriAndCountProduk(),
            'month' => $currentMonth,
            'year' => $currentYear
        ];

        $data['umkm'] = [
            'total' => $this->umkmModel->countAll(),
            'verif' => $this->umkmModel->getTotalUmkmByStatus('Terverifikasi'),
            'nonverif' => $this->umkmModel->getTotalUmkmByStatus('Belum Terverifikasi')
        ];
---
SELECT COUNT(*) AS `numrows` FROM `tbl_produk`
SELECT COUNT(*) AS `numrows` FROM `tbl_umkm`