app/Controllers/Home.php

    public function index()
    {
        $currentMonth = $this->request->getPost('month') ?? date('m');
        $currentYear = $this->request->getPost('year') ?? date('Y');

        if (session()->get('logged_in')) {
            return redirect()->to('/dashboard');
        }

        $data = [
            'title' => 'SiUMKM',
            'total' => $this->umkmModel->countAll(),
            'verif' => $this->umkmModel->getTotalUmkmByStatus('Terverifikasi'),
            'nonverif' => $this->umkmModel->getTotalUmkmByStatus('Belum Terverifikasi'),
            'total_produk' => $this->produkModel->countAll()
---
SELECT COUNT(*) AS `numrows` FROM `tbl_umkm`
SELECT COUNT(*) AS `numrows` FROM `tbl_produk`

    public function login()
    {
        $session = session();

        $username = $this->request->getVar('username');
        $password = $this->request->getVar('password');

        $user = $this->PenggunaModel->where('username', $username)->first();

        if ($user) {
            $pass = $user['password'];
            $authenticatePassword = password_verify($password, $pass);

            if ($authenticatePassword) {
                $ses_data = [
                    'username' => $user['username'],
                    'role' => $user['role'],
                    'logged_in' => true
                ];

                if($user['role'] == "pelaku_umkm"){
                    $umkm = $this->umkmModel->where('id_pengguna', $user['id_pengguna'])->first();
---
SELECT *
FROM `tbl_pengguna`
WHERE `username` = 'userx'
 LIMIT 1
SELECT *
FROM `tbl_umkm`
WHERE `id_pengguna` = '2'
 LIMIT 1