app/Controllers/Home.php

    public function simpan()
    {
        $validation = \Config\Services::validation();

        $validation->setRules([
            'nama_pemilik' => 'required',
            'NIK' => 'required|numeric|min_length[16]',
            'email' => 'required|valid_email',
            'no_hp' => 'required|numeric|min_length[10]',
            'alamat_umkm' => 'required',
            'username' => 'required|min_length[5]',
            'password' => 'required|min_length[6]',
            'confirm_password' => 'required|matches[password]',
        ]);

        if (!$validation->withRequest($this->request)->run()) {
            return redirect()->back()->withInput()->with('validation', $validation->getErrors());
        }

        $lastPengguna = $this->PenggunaModel->orderBy('id_pengguna', 'DESC')->first();
        $newIdPengguna = $lastPengguna['id_pengguna'] + 1;

        $this->PenggunaModel->insert([
            'id_pengguna' => $newIdPengguna,
            'nama_pengguna' => $this->request->getVar('nama_pemilik'),
            'username' => $this->request->getVar('username'),
            'password' => password_hash($this->request->getVar('password'), PASSWORD_DEFAULT),
            'role' => 'pelaku_umkm'
        ]);

        $this->umkmModel->insert([
            'nama_pemilik' => $this->request->getVar('nama_pemilik'),
            'NIK' => $this->request->getVar('NIK'),
            'email' => $this->request->getVar('email'),
            'no_hp' => $this->request->getVar('no_hp'),
            'alamat_umkm' => $this->request->getVar('alamat_umkm'),
            'status' => 'Belum Terverifikasi',
            'id_pengguna' => $newIdPengguna,
        ]);
---
SELECT *
FROM `tbl_pengguna`
ORDER BY `id_pengguna` DESC
 LIMIT 1
INSERT INTO `tbl_pengguna` (`id_pengguna`, `nama_pengguna`, `username`, `password`, `role`, `created_at`, `updated_at`) VALUES (3, 'Fyooo', 'fyoooo', '$2y$10$AmZK4904uSIHBynEk8kjvOvfmCzOxa.bhSCQAdH8wzQl4vLJrI09O', 'pelaku_umkm', '2024-11-10 15:03:19', '2024-11-10 15:03:19')
INSERT INTO `tbl_umkm` (`nama_pemilik`, `NIK`, `email`, `no_hp`, `alamat_umkm`, `status`, `id_pengguna`, `created_at`, `updated_at`) VALUES ('Fyooo', '3141341113310001', 'fyo@gmail.com', '08123456789', 'Jl. Maju Mundur Jaya jayaa eyyy No. 31, Kel. Jambu, Kec. Mangga, Kab.  Semangka', 'Belum Terverifikasi', 3, '2024-11-10 15:03:19', '2024-11-10 15:03:19')

    public function login()
    {
        $session = session();

        $username = $this->request->getVar('username');
        $password = $this->request->getVar('password');

        $user = $this->PenggunaModel->where('username', $username)->first();

        if ($user) {
            $pass = $user['password'];
            $authenticatePassword = password_verify($password, $pass);

            if ($authenticatePassword) {
                $ses_data = [
                    'username' => $user['username'],
                    'role' => $user['role'],
                    'logged_in' => true
                ];

                if($user['role'] == "pelaku_umkm"){
                    $umkm = $this->umkmModel->where('id_pengguna', $user['id_pengguna'])->first();
---
SELECT *
FROM `tbl_pengguna`
WHERE `username` = 'fyoooo'
 LIMIT 1
SELECT *
FROM `tbl_umkm`
WHERE `id_pengguna` = '3'
 LIMIT 1