app/Controllers/Kategori.php

    public function index()
    {

        $data = [
            'title' => 'Data Kategori | SiUMKM',
            'role' => session()->get('role'),
            'navtitle' => 'Kategori',
            'kategori' => $this->kategoriModel->findAll()
        ];
---
SELECT *
FROM `tbl_kategori`