app/Controllers/Laporan.php

    public function index()
    {

        $data = [
            'title' => 'Laporan UMKM | SiUMKM',
            'role' => session()->get('role'),
            'navtitle' => 'Laporan UMKM',
            'laporan' => $this->laporanModel->orderBy('tanggal_laporan', 'ASC')->findAll(),
        ];
---
SELECT *
FROM `tbl_laporan`
ORDER BY `tanggal_laporan` ASC

    public function tambah()
    {
        $data = [
            'title' => 'Tambah Laporan Pendapatan UMKM | SiUMKM',
            'role' => session()->get('role'),
            'navtitle' => 'Laporan UMKM',
        ];
---
SELECT *
FROM `tbl_laporan`