app/Controllers/PendapatanUmkm.php

    public function simpan()
    {
        $id_umkm = session()->get('id_umkm');

        $this->pendapatanumkmModel->save([
            'id_umkm' => $id_umkm,
            'periode' => $this->request->getVar('periode'),
            'jumlah_pendapatan_umkm' => $this->request->getVar('jumlah_pendapatan_umkm'),
        ]);
---
INSERT INTO `tbl_pendapatan_umkm` (`id_umkm`, `periode`, `jumlah_pendapatan_umkm`, `created_at`, `updated_at`) VALUES ('15', '2024-10-08', '134134134', '2024-11-14 18:18:53', '2024-11-14 18:18:53')