app/Controllers/Produk.php

    public function detail($id_produk)
    {

        $data = [
            'title' => 'Detail Produk | SiUMKM',
            'role' => session()->get('role'),
            'navtitle' => 'Produk UMKM',
            'produk' => $this->produkModel->getProdukDetail($id_produk),
        ];
---
SELECT *
FROM `tbl_produk`
WHERE `tbl_produk`.`id_produk` = '2'

    public function hapus($id_produk)
    {

        $produk = $this->produkModel->find($id_produk);
        if ($produk) {
            $foto_produk = $produk['foto_produk'];
            if ($foto_produk != 'default.png' && file_exists('img/uploads/' . $foto_produk)) {
            unlink('img/uploads/' . $foto_produk);
            }
            $this->produkModel->delete($id_produk);
---
DELETE FROM `tbl_produk`
WHERE `id_produk` IN ('2')