app/Controllers/Umkm.php

SELECT *
FROM `tbl_umkm`
---
    public function index()
    {
        $umkmModel = new UmkmModel();
        $data = [
            'title' => 'Data UMKM | SiUMKM',
            'navtitle' => 'Data UMKM',
            'umkm' => $umkmModel->findAll()
        ];