app/Controllers/User.php

SELECT *
FROM `tbl_pengguna`
---
    public function index()
    {
        $data = [
            'title' => 'User Management | SiUMKM',
            'navtitle' => 'User Management',
            'user' => $this->PenggunaModel->findAll()
        ];

SELECT *
FROM `tbl_pengguna`
WHERE `nama_pengguna` LIKE '%a%' ESCAPE '!'
---
    public function cari()
    {
        $keyword = $this->request->getVar('keyword');
        $data = [
            'title' => 'User Management | SiUMKM',
            'navtitle' => 'User Management',
            'user' => $this->PenggunaModel->like('nama_pengguna', $keyword)->findAll()