app/Models/PendapatanModel.php

        public function getPendapatanByMonthYear($month, $year)
        {
            return $this
                ->where('MONTH(periode)', $month)
                ->where('YEAR(periode)', $year)
                ->orderBy('nama_kecamatan', 'ASC')
                ->findAll();
---
SELECT *
FROM `tbl_pendapatan`
WHERE MONTH(periode) = '11'
AND YEAR(periode) = '2024'
ORDER BY `nama_kecamatan` ASC