app/Models/ProdukModel.php

SELECT `tbl_produk`.*, `tbl_kategori`.`nama_kategori`
FROM `tbl_produk`
JOIN `tbl_kategori` ON `tbl_kategori`.`id_kategori` = `tbl_produk`.`id_kategori`
---
        public function getProdukWithKategori()
        {
            return $this->select('tbl_produk.*, tbl_kategori.nama_kategori')
                        ->join('tbl_kategori', 'tbl_kategori.id_kategori = tbl_produk.id_kategori')
                        ->findAll();

SELECT `tbl_produk`.*, `tbl_kategori`.`nama_kategori`, `tbl_umkm`.`nama_pemilik`, `tbl_umkm`.`alamat_umkm`, `tbl_umkm`.`no_hp`
FROM `tbl_produk`
JOIN `tbl_kategori` ON `tbl_kategori`.`id_kategori` = `tbl_produk`.`id_kategori`
JOIN `tbl_umkm` ON `tbl_umkm`.`id_umkm` = `tbl_produk`.`id_umkm`
WHERE `id_produk` = '3'
 LIMIT 1
---
        public function getProdukDetail($id_produk = false)
        {
            return $this->select('tbl_produk.*, tbl_kategori.nama_kategori, tbl_umkm.nama_pemilik, tbl_umkm.alamat_umkm, tbl_umkm.no_hp')
                ->join('tbl_kategori', 'tbl_kategori.id_kategori = tbl_produk.id_kategori')
                ->join('tbl_umkm', 'tbl_umkm.id_umkm = tbl_produk.id_umkm')
                ->where(['id_produk' => $id_produk])
                ->first();

SELECT `tbl_produk`.*, `tbl_kategori`.`nama_kategori`
FROM `tbl_produk`
JOIN `tbl_kategori` ON `tbl_kategori`.`id_kategori` = `tbl_produk`.`id_kategori`
WHERE `tbl_produk`.`id_umkm` = '17'
---
        public function getProdukByUmkm($id)
        {
            return $this->select('tbl_produk.*, tbl_kategori.nama_kategori')
                        ->join('tbl_kategori', 'tbl_kategori.id_kategori = tbl_produk.id_kategori')
                        ->where(['tbl_produk.id_umkm' => $id])
                        ->findAll();

SELECT COUNT(*) AS `numrows`
FROM `tbl_produk`
WHERE `id_umkm` = '13'
---
        public function countProdukByUmkm($id)
        {
            return $this->where(['id_umkm' => $id])->countAllResults();