app/Models/UmkmModel.php

SELECT COUNT(*) AS `numrows`
FROM `tbl_umkm`
WHERE `status` = 'Terverifikasi'
---
        public function getTotalUmkmByStatus($status)
        {
            return $this->where('status', $status)->countAllResults();

SELECT `tbl_umkm`.`status`
FROM `tbl_umkm`
WHERE `tbl_umkm`.`id_umkm` = '17'
 LIMIT 1
---
        public function getUmkmVerif($id)
        {
            return $this->select('tbl_umkm.status')
                        ->where(['tbl_umkm.id_umkm' => $id])
                        ->first();